# Instructions

Create a Python connection with SQL database and retrieve the results of the following queries as dataframes:

- How many distinct (different) actors' last names are there?
- Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.
- Get all films with ARMAGEDDON in the title.
- Get 10 the longest films.
- How many films include Behind the Scenes content?
- Which kind of movies (rating) have a mean duration of more than two hours?
- Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [1]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

from sklearn.metrics import confusion_matrix, accuracy_score, precision_score, recall_score, ConfusionMatrixDisplay
from sklearn.metrics import classification_report, f1_score, cohen_kappa_score

import getpass  # To get the password without showing the input

In [2]:
password = getpass.getpass()

········

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [12]:
# How many distinct (different) actors' last names are there?

actors = pd.read_sql_query('SELECT * FROM actor', engine)
actors.head()
actors['last_name'].unique().shape[0]

121

In [16]:
# Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

rentals = pd.read_sql_query('''Select *, rental_date, DAYNAME(convert(rental_date,date)) as weekday, 
        CASE WHEN DAYNAME(convert(rental_date,date)) IN ('Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday') 
        Then 'workday'ELSE 'weekend'END as day_type FROM sakila.rental''',engine)

rentals.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,rental_date,weekday,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,2005-05-24 22:53:30,Tuesday,workday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,2005-05-24 22:54:33,Tuesday,workday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,2005-05-24 23:03:39,Tuesday,workday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,2005-05-24 23:04:41,Tuesday,workday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,2005-05-24 23:05:21,Tuesday,workday

In [21]:
# Get all films with ARMAGEDDON in the title.

armageddon = pd.read_sql_query(
    '''SELECT * FROM sakila.film''',engine)

In [30]:
# Get all films with ARMAGEDDON in the title.

armageddon = pd.read_sql_query(
    '''SELECT * FROM sakila.film
        WHERE title LIKE "%%ARMAGEDDON%%" ''',engine)

armageddon.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,39,ARMAGEDDON LOST,A Fast-Paced Tale of a Boat And a Teacher who ...,2006,1,None,5,0.99,99,10.99,G,Trailers,2006-02-15 05:03:42
1,507,LADYBUGS ARMAGEDDON,A Fateful Reflection of a Dog And a Mad Scient...,2006,1,None,4,0.99,113,13.99,NC-17,Deleted Scenes,2006-02-15 05:03:42
2,571,METAL ARMAGEDDON,A Thrilling Display of a Lumberjack And a Croc...,2006,1,None,6,2.99,161,26.99,PG-13,"Trailers,Commentaries,Deleted Scenes",2006-02-15 05:03:42
3,598,MOSQUITO ARMAGEDDON,A Thoughtful Character Study of a Waitress And...,2006,1,None,6,0.99,57,22.99,G,Trailers,2006-02-15 05:03:42
4,838,STAGECOACH ARMAGEDDON,A Touching Display of a Pioneer And a Butler w...,2006,1,None,5,4.99,112,25.99,R,"Trailers,Deleted Scenes",2006-02-15 05:03:42

In [29]:
# Get 10 the longest films.

longest_films = pd.read_sql_query(
    '''SELECT * FROM sakila.film
        ORDER BY (length)DESC LIMIT 10
    ''',engine)

longest_films.head(10)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,349,GANGS PRIDE,A Taut Character Study of a Woman And a A Shar...,2006,1,None,4,2.99,185,27.99,PG-13,Behind the Scenes,2006-02-15 05:03:42
1,872,SWEET BROTHERHOOD,A Unbelieveable Epistle of a Sumo Wrestler And...,2006,1,None,3,2.99,185,27.99,R,Deleted Scenes,2006-02-15 05:03:42
2,609,MUSCLE BRIGHT,A Stunning Panorama of a Sumo Wrestler And a H...,2006,1,None,7,2.99,185,23.99,G,Deleted Scenes,2006-02-15 05:03:42
3,817,SOLDIERS EVOLUTION,A Lacklusture Panorama of a A Shark And a Pion...,2006,1,None,7,4.99,185,27.99,R,"Trailers,Commentaries,Deleted Scenes,Behind th...",2006-02-15 05:03:42
4,690,POND SEATTLE,A Stunning Drama of a Teacher And a Boat who m...,2006,1,None,7,2.99,185,25.99,PG-13,"Trailers,Commentaries,Behind the Scenes",2006-02-15 05:03:42
5,141,CHICAGO NORTH,A Fateful Yarn of a Mad Cow And a Waitress who...,2006,1,None,6,4.99,185,11.99,PG-13,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
6,182,CONTROL ANTHEM,A Fateful Documentary of a Robot And a Student...,2006,1,None,7,4.99,185,9.99,G,Commentaries,2006-02-15 05:03:42
7,991,WORST BANGER,A Thrilling Drama of a Madman And a Dentist wh...,2006,1,None,4,2.99,185,26.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
8,426,HOME PITY,A Touching Panorama of a Man And a Secret Agen...,2006,1,None,7,4.99,185,15.99,R,"Trailers,Commentaries,Behind the Scenes",2006-02-15 05:03:42
9,212,DARN FORRESTER,A Fateful Story of a A Shark And a Explorer wh...,2006,1,None,7,4.99,185,14.99,G,Deleted Scenes,2006-02-15 05:03:42

In [32]:
#How many films include Behind the Scenes content?

behind_scenes = pd.read_sql_query('''
                                SELECT count(film_id) FROM sakila.film
                                WHERE special_features LIKE '%%Behind the Scenes%%' ''', engine )
behind_scenes.head()

   count(film_id)
0             538

In [45]:
# Which kind of movies (rating) have a mean duration of more than two hours?

rating = pd.read_sql_query('''SELECT rating, count(film_id), round(AVG(length),2) FROM sakila.film
                                GROUP BY rating HAVING round(AVG(length),2) >120''', engine)

rating.head()

  rating  count(film_id)  round(AVG(length),2)
0  PG-13             223                120.44

In [43]:
# Rank films by length (filter out the rows that have nulls or 0s in length column). 
# In your output, only select the columns title, length, and the rank.

films = pd.read_sql_query('''SELECT title as title, length as length, rank() over (order by length DESC) as 'rank'
                                FROM sakila.film WHERE length NOT IN ('',0) ORDER BY length DESC''', engine)

films.head(20)

                 title  length  rank
0        CHICAGO NORTH     185     1
1       CONTROL ANTHEM     185     1
2       DARN FORRESTER     185     1
3          GANGS PRIDE     185     1
4            HOME PITY     185     1
5        MUSCLE BRIGHT     185     1
6         POND SEATTLE     185     1
7   SOLDIERS EVOLUTION     185     1
8    SWEET BROTHERHOOD     185     1
9         WORST BANGER     185     1
10   CONSPIRACY SPIRIT     184    11
11    CRYSTAL BREAKING     184    11
12      KING EVOLUTION     184    11
13     MOONWALKER FOOL     184    11
14     SMOOCHY CONTROL     184    11
15      SONS INTERVIEW     184    11
16      SORORITY QUEEN     184    11
17      THEORY MERMAID     184    11
18       CATCH AMISTAD     183    19
19      FRONTIER CABIN     183    19